#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_ecr_image.service_image: Reading...
data.aws_ecr_image.service_image: Read complete after 0s [id=sha256:6dd3028e2d279d8e1bff8200a613d478f02dd7417d022b45a6f3defb49f68396]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lambda_function.my_lambda will be created
  + resource "aws_lambda_function" "my_lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "reddit_scraper"
      + id                             = (known after apply)
      + image_uri                      = "034518632467.dkr.ecr.us-east-1.amazonaws.com/reddit_scraper@sha256:6dd3028e2d279d8e1bff8200a613d478f02dd7417d022b45a6f3defb49f68396"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::034518632467:role/service-role/reddit_data_eng_leads-role-qnm6930v"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + ephemeral_storage {
          + size = (known after apply)
        }

      + logging_config {
          + application_log_level = (known after apply)
          + log_format            = (known after apply)
          + log_group             = (known after apply)
          + system_log_level      = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @chonkbros, Action: `pull_request`*